# TooSmallNumberOfBars Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..TooSmallNumberOfBars Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Set must contain at least two bar locations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooSmallNumberOfBars { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooSmallNumberOfBars As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooSmallNumberOfBars {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace